WcfHarness/WcfHarness/RequestXmls/ManageAPIKeyRoles.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ManageAPIKeyRoles xmlns="http://www.tavisca.com/Vexiere/IAPIKey/2013/01">
      <manageAPIKeyRolesRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:APIKey>ZWE3YWY1OTgtY2VlOC00NjY3LWFiYTQtNWY5OTdjNTUyNGZi</a:APIKey>
        <a:OperationMode>OverWriteMode</a:OperationMode>
        <a:OwnerOrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OwnerOrganizationIdentifier>
        <a:RoleIdentifiers>
          <a:RoleIdentifier i:type="a:IdBasedRoleIdentifier">
            <a:Id>10</a:Id>
          </a:RoleIdentifier>
          <a:RoleIdentifier i:type="a:IdBasedRoleIdentifier">
            <a:Id>11</a:Id>
          </a:RoleIdentifier>
        </a:RoleIdentifiers>
      </manageAPIKeyRolesRequest>
    </ManageAPIKeyRoles>
  </s:Body>
</s:Envelope>